OdDAI.EntityExtent.getInstancesOf(OdDAI.Entity!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves all instances from extents which are instances of provided entity type definition.
\returns An array of object identifiers of instances of a type.

OdDAI.EntityExtent.getInstancesOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves all instances from extents which are instances of provided entity type name.
\returns An array of object identifiers of instances of a type.

OdDAI.EntityExtent.load
\details
Loads all enitites from this entity extent container.
\returns Returns eOk if success, otherwise it should return an error code

OdDAI.EntityExtent.unload
\details
Unloads all enitites from this entity extent container.
\returns Returns eOk if success, otherwise it should return an error code

OdDAI.EntityExtent.name
\details
Returns the type name of the entity definition of this entity extent.

OdDAI.EntityExtent.definition
\details
Returns a smart pointer to the entity definition of this entity extent.

OdDAI.EntityExtent.instances
\details
Returns an aggregate of object ids of entity instances for the folder.